IDEA StatiCa Open Model
ParameterDouble Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Double parameter of cross-section
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.CrossSection.Parameter
 IdeaRS.OpenModel.CrossSection.ParameterDouble
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ParameterDouble : Parameter
Public Class ParameterDouble
	Inherits Parameter
public ref class ParameterDouble : public Parameter
The ParameterDouble type exposes the following members.
Constructors
Name | Description
ParameterDouble
Initializes a new instance of the ParameterDouble class
Top
Properties
Name | Description
Name
 Name of property
 (Inherited from Parameter.)
Value
 Value
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace